---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.DocumentPrintingEventArgs
source: html/32a63dd2-e25b-94b3-5a22-d36c20ef854f.htm
---
# DocumentPrintingEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.